[
  {
    "id": 1,
    "name": "Greg Carr",
    "title": "Solid Read",
    "comment": "The only book on this topic that I know of, at the moment, on atheism written by a Muslim. Islam has such a rich tradition, it really has all the answers to any sort of doubt in God that no other religion can compare to. Rock-solid read and I hope more books on this topic will be written by Muslims in the future.",
    "ratting": 5
  },
  {
    "id": 2,
    "name": "Ismail Kamdar",
    "title": "A must-read for the young and the confused!",
    "comment": "The Divine Reality is a must-read for every young person confused about religion and God. It explains very compassionately and logically the case for the existence of God, evidences for the truth of the Quran and Prophethood of Muhammad, and most importantly provides clear logical reasons for why humans should worship their Creator. I highly recommend this book for all person involved in Dawah or experiencing doubts about these topics. ",
    "ratting": 5
  },
  {
    "id": 3,
    "name": "Zaur Guchetl",
    "title": "Cogent, engaging and very readable.",
    "comment": "Hamza starts from the personal story of his own journey to Islam. He delves the history of atheism and new atheism at first and discusses the incompleteness and irrationality of atheistic worldview . The most fascinating is that the book deals with a lot of argument for the existence of God and irrationality of atheism from natural theology but maintains an Islamic flavor from authentic sources and highlights the notable works of classical Islamic scholars and theologians related to these arguments . The book reflects not only an intellectual defence but a spiritual one. Hamza develops a structured case for the reliability of Quran as a Divine book based on epistemic testimony and inference to the best explanation of linguistic inimitability of Quran. He presents a cumulative and persuasive case for Islam in both intellectual and spiritual perspective. I think the effort will be a millstone in contemporary Islamic philosophy and apologetics. ",
    "ratting": 5
  },
  {
    "id": 4,
    "name": "Limitless Envy",
    "title": "Clearance of the cloud and doubt from ones heart",
    "comment": "Best way to describe this book is the clearance of doubt for many Muslims facing rational debates that make you question certain aspects of the islamic faith and deen. A worthy intellectual adventure for one to reflect and strengthen their Islam. Very organized in explaining aspects of creation and creator, questions raised by intellectuals on atheism and theism, and the Islamic ans quranic take on addressing those question. Must read. ",
    "ratting": 5
  },
  {
    "id": 5,
    "name": "Istrt",
    "title": "An Important Book",
    "comment": "...especially in this day and age where shunning God out of your lives is revered and celebrated. This book gives detailed and relatable explanation of every possible question or doubt regarding a Supreme/Higher Power. In addition, this book is not only a excellent source of such discussions but also can answer many questions of even believers who are not comfortable asking difficult questions and can erase any doubts in their own minds.",
    "ratting": 5
  },
  {
    "id": 6,
    "name": "wahafiz",
    "title": " I consider myself as quite philosophical. But I struggle ...",
    "comment": "I consider myself as quite philosophical. But I struggle to understand certain parts of the book. Despite that, i am very thankful to have this book in my possession as I don't think I've read any similar book that discuss the existence of God, from a combined philosophical and islamic perspective. ",
    "ratting": 4
  },
  {
    "id": 7,
    "name": "Mr Street",
    "title": "A completely different perspective to the conventional way of thinking in regards to God",
    "comment": "Hopefully this will motivate students and scholars to publish more literature of this category. We see millions of books explaining Islamic jurisprudence etc, and other witty books mocking theism. This is a book not about Islam nor Atheism but more about the narrative of modern secularized society vs perception of reality. Hamza Tzortzis hits the nail on the head yet again.",
    "ratting": 5
  }
]
